<!DOCTYPE HTML PUBLIC "-//W3C//DTD HTML 4.0//EN" "http://www.w3.org/TR/REC-html40/strict.dtd">
<HTML>
	<HEAD>
		<LINK href="../povdocfr_style.css" rel="stylesheet" type="text/css">
		<TITLE>le raytracing et POV-Ray - documentation POV-Ray en fran&ccedil;ais		</TITLE>
	</HEAD>

	<BODY>
<P><A href="../index.htm">vers l'index g&eacute;n&eacute;ral de l'aide</A> 
/ <A href="index-cpt.htm">vers l'index des concepts généraux</A></P>
		
 <H1>C'est quoi le raytracing ?</H1>
<P>Connu en fran&ccedil;ais sous le nom de "lancer de rayons", "trac&eacute; de rayons" ou encore "suivi de rayons",
   la raytracing est une technique de rendu d'images photor&eacute;alistes, dont les algorithmes
   utilisent -autant que possible- les propri&eacute;t&eacute;s optiques des lumi&egrave;res, objets et mat&eacute;riaux.</P>
<P>Ainsi, le raytracing est particuli&egrave;rement "dou&eacute;" lorsqu'il s'agit de simuler des ph&eacute;nom&egrave;nes
   tels que la r&eacute;flexion (surfaces r&eacute;fl&eacute;chissantes) et la r&eacute;fraction (d&eacute;formations dans des milieux
   comme l'eau ou le verre).</P>
<P>Les algorithmes utilis&eacute;s sont souvent simples et &eacute;l&eacute;gants, en comparaison d'autres proc&eacute;d&eacute;s
   de rendu.  La contrepartie de l'&eacute;l&eacute;gance et de la pr&eacute;cision du raytracing, c'est une certaine
   lenteur, et il n'est pas rare d'avoir besoin de plusieurs heures pour des rendus d&eacute;finitifs
   (heureusement, lors de la conception des sc&egrave;nes, il existe plein de ficelles pour visualiser
    tr&egrave;s vite certaines choses).</P>

 <H1>C'est quoi POV-Ray ?</H1>

<P>Si vous &ecirc;tes arriv&eacute;s jusqu'ici, c'est que vous avez d&eacute;j&agrave; une petite id&eacute;e de la r&eacute;ponse,
   mais nous allons tout de m&ecirc;me y revenir.</P>

<P>POV-Ray est donc un logiciel de raytracing, d&eacute;velopp&eacute; par une &eacute;quipe (mouvante) de
   programmeurs talentueux, qui, pour la plupart, ne se connaissent pas physiquement !
   Cette &eacute;quipe s'appelle la "POV-Team".  </P>
<P>POV-Ray pr&eacute;sente quelques particularit&eacute;s :</P>
<P>- il est gratuit !  Attention, ce n'est pas un logiciel du domaine public, ni une
     licence GNU, GPL,...  Le logiciel est soumis &agrave; un copyright, mais le code source
     est disponible et modifiable sous les conditions d&eacute;crite dans la licence, et vous
     pouvez distribuer (gratuitement !) des copies du logiciel, sans restrictions.
     N'oubliez donc jamais que POV-Ray est le fruit d'un travail b&eacute;n&eacute;vole, et que ses
     auteurs m&eacute;ritent du respect et de la qui&eacute;tude.<P>

<P>- au lieu de disposer d'un "modeleur" (logiciel qui permet de manipuler visuellement
     les objets d'une sc&egrave;ne), POV-Ray fonctionne sur base d'un syst&egrave;me de script, devenu
     au fil des ann&eacute;es un v&eacute;ritable langage de programmation.  Ce syst&egrave;me peut para&icirc;tre
     ardu au premier abord, mais l'apprentissage en est tr&egrave;s facile, et une fois que
     vous aurez go&ucirc;t&eacute; &agrave; la puissance de ce syst&egrave;me, combin&eacute; &agrave; l'immense richesse de POV-Ray,
     vous aurez du mal &agrave; vous en passer !  Par ailleurs, il existe une foule d'utilitaires,
     du plus simple au plus complexe, d&eacute;di&eacute;s &agrave; POV-Ray : modeleurs g&eacute;n&eacute;ralistes, modeleurs
     pour un type d'objet particulier, convertisseurs de format, etc,...</P>

<P>- il est disponible pour un nombre incroyable de syst&egrave;mes informatiques : MS-DOS,
     Windows, MacOS, Linux, Unix (et autres variantes), BeOS, Amiga (!), Atari (!!),...
     Et dans le pire des cas, vous pouvez tout simplement aller chercher le code source
     et le compiler pour votre plate-forme.</P>

<P>- il est soutenu par une importante communaut&eacute; d'utilisateurs, d&eacute;butants, confirm&eacute;s
     ou experts, qui aiment se retrouver dans les forums officiels (news.povray.org),
     ou dans des forums ind&eacute;pendants non-anglophones.  Parmi ces utilisateurs, certains
     choisissent de mettre la main &agrave; la p&acirc;te, et de proposer des versions "am&eacute;lior&eacute;es"
     de POV-Ray, versions non-officielles regorgeant de fonctionnalit&eacute;s in&eacute;dites, ou
     exp&eacute;rimentales, qui ont une chance de se retrouver dans les futures versions officielles
     de POV-Ray.  A l'heure o&ugrave; nous &eacute;crivons ces lignes, la plus fameuse de ces versions
     est "MegaPOV", une initiative de Nathan Kopp, dont beaucoup d'utilisateurs ne sauraient
     plus se passer !</P>


<H2>J'ai besoin d'aide !</H2>
<H3>le forum officiel, anglophone</H3>
<P><A href="news://news.povray.org/">news.povray.org</A></P>
<H3>les forums (oui, bon, "fora" !) ind&eacute;pendants francophones</H3>
<P><A href="news://news.zoo-logique.org/">Zoo-Logique : news.zoo-logique.org</A></P>
<P><A href="news://news.3dvf.net/">3DVF : news.3dvf.net</A></P>

<H2>Où trouver POV-Ray ?</H2>
 <P>Valable au 26 Juin 2002</P>
<H3>Quelle est la version la plus r&eacute;cente de POV-Ray ?</H3>
 <P><A href="http://www.povray.org/download">POV-Ray 3.5</A></P>
<H3>Quelle est la plus chouette version non-offielle de POV-Ray ?</H3>
 <P><A href="http://nathan.kopp.com/">MegaPOV</A></P>
<H3>Quand est-ce que POV-Ray 4.0 sera disponible ?</H3>
 <P>Ouul&agrave;&agrave;&agrave; !  Pas avant un bon bout de temps, probablement.  POV-Ray 4.0 sera une r&eacute;&eacute;criture
    compl&egrave;te, en C++ (et plus en C).  Essayez d'abord de gagner l'IRTC avec POV-Ray 3.5, 
   on en reparlera après* :-)</P>

<P><I>r&eacute;dacteur : Fabien Mosen</I></P>
	</BODY>
</HTML>
